RubyLessons/Lesson8/labs_reports/app/controllers/labs_controller.rb

SELECT "labs".* FROM "labs"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 3]]
---
  def index
    @labs = Lab.includes(:user)

DELETE FROM "labs" WHERE "labs"."id" = ?  [["id", 8]]
---
  def destroy
    @lab.destroy

INSERT INTO "labs" ("title", "description", "grade", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["description", ""], ["grade", nil], ["created_at", "2023-09-16 17:37:09.288959"], ["updated_at", "2023-09-16 17:37:09.288959"], ["user_id", 2]]
---
  def create
    @lab = Lab.new(lab_params)
    if @lab.save

UPDATE "labs" SET "grade" = ?, "updated_at" = ? WHERE "labs"."id" = ?  [["grade", 4], ["updated_at", "2023-09-16 17:55:57.392064"], ["id", 8]]
---
  def mark
    if @lab.update(mark_params)

SELECT "labs".* FROM "labs" WHERE "labs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def set_lab
    @lab = Lab.find(params[:id])